resources/views/livewire/Untitled-1.txt

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soap:Header>
        <wsse:Security soap:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
            <wsse:UsernameToken wsu:Id="UsernameToken-17855236" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
                <wsse:Username>WSALHARAMPAY</wsse:Username>
                <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">1234pass</wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
    </soap:Header>
    <soap:Body xmlns:ns1="http://www.opentravel.org/OTA/2003/05">
        <ns1:OTA_AirAvailRQ EchoToken="11868765275150-1300257933" PrimaryLangID="en-us" SequenceNmbr="1" TimeStamp="2012-08-27T03:00:23" Version="20061.00" Target="TEST">
            <ns1:POS>
                <ns1:Source TerminalID="TestUser/Test Runner">
                    <ns1:RequestorID ID="WSALHARAMPAY" Type="4"/>
                    <ns1:BookingChannel Type="12" />
                </ns1:Source>
            </ns1:POS>
            <ns1:OriginDestinationInformation>
                <ns1:DepartureDateTime WindowAfter="P3D" WindowBefore="P3D">2024-07-19T00:00:00.000</ns1:DepartureDateTime>
                <ns1:OriginLocation LocationCode="SHJ"/>
                <ns1:DestinationLocation LocationCode="DAM"/>
            </ns1:OriginDestinationInformation>
            <ns1:OriginDestinationInformation>
                <ns1:DepartureDateTime WindowAfter="P3D" WindowBefore="P3D">2024-07-19T00:00:00.000</ns1:DepartureDateTime>
                <ns1:OriginLocation LocationCode="DAM"/>
                <ns1:DestinationLocation LocationCode="SHJ"/>
            </ns1:OriginDestinationInformation>
            <ns1:TravelerInfoSummary>
                <ns1:AirTravelerAvail>
                    <ns1:PassengerTypeQuantity Code="ADT" Quantity="2"/>
                    <ns1:PassengerTypeQuantity Code="CHD" Quantity="1"/>
                    <ns1:PassengerTypeQuantity Code="INF" Quantity="1"/>
                </ns1:AirTravelerAvail>
            </ns1:TravelerInfoSummary>
        </ns1:OTA_AirAvailRQ>
    </soap:Body>
</soap:Envelope>