src/Assets/MahanRequestTemplates/SearchFlight.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <soap:Header>
    <wsse:Security soap:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
      <wsse:UsernameToken>
        <wsse:Username>{{Username}}</wsse:Username>
        <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">{{Password}}</wsse:Password>
      </wsse:UsernameToken>
    </wsse:Security>
  </soap:Header>
  <soap:Body xmlns:ns2="http://www.opentravel.org/OTA/2003/05">
    <!-- <OTA_AirAvailRQ Target="Production|Test" PrimaryLangID="en-us"> -->
    <ns2:OTA_AirAvailRQ PrimaryLangID="en-us">
      <ns2:POS>
        <!-- {{OfficeID}} -->
        <ns2:Source TerminalID="{{TerminalID}}">
          <ns2:RequestorID ID="{{Username}}" Type="{{UniqueIDType}}" />
          <ns2:BookingChannel Type="{{BookingChannelType}}" />
        </ns2:Source>
      </ns2:POS>
      {{OriginDestinationInformation}}
      <!-- <FlexiQuote>true</FlexiQuote> -->
      <ns2:TravelerInfoSummary>
        <ns2:AirTravelerAvail>
          {{Passengers}}
        </ns2:AirTravelerAvail>
      </ns2:TravelerInfoSummary>
    </ns2:OTA_AirAvailRQ>
  </soap:Body>
</soap:Envelope>